Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: གང་རང་སངས་རྒྱས་ཀྱི་དབང་པོ་ཅན་ལ་ཉན་ཐོས་སུ་སྦྱོར་བ་ཅན་དང་། གང་རང་བྱང་ཆུབ་ཀྱི་དབང་པོ་ཅན་ལ་སངས་རྒྱས་སུ་སྦྱོར་བ་ཅན་དང་། གང་སངས་རྒྱས་ཀྱི་དབང་པོ་ཅན་ལ་རང་བྱང་ཆུབ་ལ་སྦྱོར་བ་ཅན་དང་། གང་འཁོར་བའི་དབང་པོ་ཅན་ལ་འབྱུང་བ་ལ་སྦྱོར་བ་ཅན་དང་། གང་འབྱུང་བའི་དངོས་པོ་ཅན་ལ་འཁོར་བར་སྦྱོར་བ་ཅན་དེ་དག་ཐམས་ཅད་མཁྱེན་ནས་དེ་དག་དང་འཚམ་པར་ཆོས་སྟོན་ཏོ།
en: They know and teach the appropriate doctrine to any of those with a faculty for the applications of mindfulness who are practicing the right abandonments, to any of those with a faculty for the right abandonments who are practicing the applications of mindfulness, and so on (connect the dharmas on the side of awakening like that); to any of those with a faculty for inner emptiness who are abiding in outer emptiness and so on (connect all the emptinesses like that); to any of those with the faculty of a śrāvaka who are practicing a pratyekabuddha’s awakening, to any of those with the faculty for a pratyekabuddha’s awakening whose practice would make them śrāvakas, to any of those with the faculty of a śrāvaka whose practice would make them pratyekabuddhas, to any of those with the faculty of a pratyekabuddha whose practices would make them śrāvakas, to any of those with the faculty for a pratyekabuddha’s awakening whose practice would make them buddhas, and to any of those with the faculty of a buddha whose practice would lead to a pratyekabuddha’s awakening; and to any of those with the faculty for saṃsāra whose practices are for escape, and to any of those with the faculty for escape whose practice is for saṃsāra.

source: །འདི་ནི་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་སོ།
en: This is the power of knowing “higher and lower faculties.”

source: །ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བ་ནི་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཉིད་དུ་ངེས་པར་ཤེས་པའི་སེམས་ཅན་གྱི་ཁམས་དང་།
en: Sixth power “Accurately knowing the path wherever it goes.”

source: ལོག་པ་ཉིད་དུ་ངེས་པ་དང་། མ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་རབ་ཏུ་མཁྱེན་ཏོ།
en: Here the tathāgatas know the basic character of beings who are destined to be correct, and the basic character of beings destined and not necessarily destined to be wrong.

source: །དེ་ལ་ཡང་དག་པ་ཉིད་དུ་ངེས་པ་དང་མ་ངེས་པ་རྣམས་དང་མཐུན་པའི་ལམ་ཡང་མཁྱེན་ཏོ།
en: They also know the paths that harmonize with those destined and not necessarily destined for perfection.

source: །ལོག་པ་ཉིད་དུ་ངེས་པ་རྣམས་ནི་བཏང་སྙོམས་སུ་བྱ་བ་དང་མཐུན་པར་མཁྱེན་ཏོ།
en: In regard to those destined to be wrong, they know what is in harmony with what they do, while staying aloof.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་དོན་དུ་གོ་ཆ་གྱོན་ཏོ།
en: The bodhisattvas don armor for their sake.

source: །འདོད་ཆགས་ཀྱི་ལམ་རྣམ་པ་གསུམ་ཡང་མཁྱེན་ཏེ། །འདོད་ཆགས་ཀྱི་ལམ་སྡུག་པའི་རྣམ་པ་ལས་བྱུང་བ་ཡང་ཡོད།
en: They also know the threefold path of attachment.

source: འདོད་ཆགས་ཀྱི་ལམ་རྗེས་སུ་ཆགས་པའི་རྣམ་པ་ལས་བྱུང་བ་ཡང་ཡོད། འདོད་ཆགས་ཀྱི་ལམ་སྔོན་གྱི་ཚེ་རབས་ལ་གོམས་པའི་སྟོབས་ལས་བྱུང་བ་ཡང་ཡོད།
en: They know there is a path of attachment that comes about from something nice-looking; and a path of attachment that comes about when somebody is nice; and a path of attachment that comes about from the power of habituation in an earlier life.

source: ཞེ་སྡང་གི་ལམ་ཀུན་ནས་མནར་སེམས་ཀྱི་གཞི་ལས་བྱུང་བ་ཡང་ཡོད། མཚན་མ་ལས་བྱུང་བའི་ཁོང་ཁྲོ་བ་དེ་ལྟ་བུ་ཡང་ཡོད། སྔོན་གྱི་རྒྱུ་ལས་བྱུང་བ་ཡང་ཡོད། གཏི་མུག་གི་ལམ་ལ་རིག་པའི་རྒྱུ་ལས་བྱུང་བ་ཡང་ཡོད། འཇིག་ཚོགས་ལ་ལྟ་བའི་རྒྱུ་ལས་བྱུང་བ་ཡང་ཡོད།
en: They also know there is a path of anger that comes about from the object of a malicious thought; similarly that is a wrath that comes about from something indicating [an object of an intense dislike]; and that comes about from a prior cause.

source: ཐེ་ཚོམ་གྱི་རྒྱུ་ལས་བྱུང་བ་ཡང་ཡོད་པར་རབ་ཏུ་མཁྱེན་ཏོ། །དེ་ལ་མངོན་པར་ཤེས་པ་སླ་ལ་བུལ་བའི་ལམ་ཡང་ཡོད། མངོན་པར་ཤེས་པ་དཀའ་ལ་མྱུར་བའི་ལམ་ཡང་ཡོད། མངོན་པར་ཤེས་པ་སླ་ལ་མྱུར་བའི་ལམ་ཡང་ཡོད། མངོན་པར་ཤེས་པ་དཀའ་ལ་བུལ་བའི་ལམ་ཡང་ཡོད། སོ་སོར་བརྟགས་པའི་སྟོབས་རྫོགས་པར་བྱེད་ལ། བསྒོམ་པའི་སྟོབས་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། བསྒོམ་པའི་སྟོབས་རྫོགས་པར་བྱེད་ལ་སོ་སོར་བརྟགས་པའི་སྟོབས་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། གཉི་ག་རྫོགས་པར་བྱེད་པའི་ལམ་ཡང་ཡོད། གཉི་ག་རྫོགས་པར་མི་བྱེད་པ་ཡང་ཡོད།
en: And they know there is a path of confusion that comes about with ignorance as the cause, that comes about with the view of the true body as the cause, and that comes about with doubt as the cause.

source: བསམ་པ་ཕུན་སུམ་ཚོགས་ལ་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། སྦྱོར་བ་ཕུན་སུམ་ཚོགས་ལ་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། གཉི་ག་ཕུན་སུམ་ཚོགས་པ་ཡང་ཡོད། གཉི་ག་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། ལུས་དག་པར་བྱེད་ལ་ངག་དང་སེམས་དག་པར་མི་བྱེད་པའི་ལམ་ཡང་ཡོད། ངག་དག་པར་བྱེད་ལ་ལུས་དང་སེམས་དག་པར་མི་བྱེད་པ་ཡང་ཡོད། ཡིད་དག་པར་བྱེད་ལ་ལུས་དང་ངག་དག་པར་མི་བྱེད་པ་ཡང་ཡོད། ལུས་དང་ངག་དག་པར་བྱེད་ལ་སེམས་དག་པར་མི་བྱེད་པ་ཡང་ཡོད། གང་དག་སེམས་དག་པར་བྱེད་ལ་ལུས་དག་པར་མི་བྱེད་པ་ཡང་ཡོད། ལུས་དང་སེམས་དག་པར་བྱེད་ལ་ངག་དག་པར་མི་བྱེད་པ་ཡང་ཡོད། ལུས་དང་ངག་དག་པར་བྱེད་ལ་ཡིད་དག་པར་མི་བྱེད་པ་ཡང་ཡོད། ཐམས་ཅད་དག་པར་མི་བྱེད་པ་ཡང་ཡོད། འདིར་སྡུག་བསྔལ་ལ་ཕ་རོལ་དུ་བདེ་བར་འགྱུར་བའི་ལམ་ཡང་ཡོད། འདིར་བདེ་བ་ལ་ཕ་རོལ་དུ་སྡུག་བསྔལ་བར་འགྱུར་བ་ཡང་ཡོད། གཉི་གར་སྡུག་བསྔལ་བར་འགྱུར་བ་ཡང་ཡོད། གཉི་གར་བདེ་བར་འགྱུར་བ་ཡང་ཡོད། བདག་ལ་ཕན་ལ་གཞན་ལ་ཕན་པར་མི་འགྱུར་བའི་ལམ་ཡང་ཡོད།
en: They also know there is a slow path where clairvoyance is easy, and a quick path where clairvoyance is hard; a quick path where clairvoyance is easy, and a slow path where clairvoyance is hard; a path that fully completes the power of analysis but not the power of meditation, a path that fully completes the power of meditation but not the power of analysis, a path that fully completes them both, and one that does not fully complete them both; and also a path where the intention is perfect but the execution is not perfect, a path where the execution is perfect but the intention is not perfect, a path where both are perfect, and one where both are not perfect; and also a path that purifies body but does not purify speech and mind, one that purifies speech but does not purify body and mind, one that purifies thinking mind but does not purify body and speech, and one that purifies body and speech but does not purify mind; and also one that purifies mind but does not purify body and speech; and also one that purifies body and mind but does not purify speech, and one that purifies body and speech but does not purify thinking mind, and one that does not purify any of them.

source: གཞན་ལ་ཕན་ལ་བདག་ལ་ཕན་པར་མི་འགྱུར་བ་ཡང་ཡོད། གཉི་ག་ལ་ཕན་པར་འགྱུར་བ་ཡང་ཡོད། གཉི་ག་ལ་ཕན་པར་མི་འགྱུར་བ་ཡང་ཡོད། འདོད་པའི་ཁམས་ཀྱི་འབྲས་བུའི་ལམ་ཡང་ཡོད། འདོད་པ་ལ་འདོད་ཆགས་ཀྱི་གཉེན་པོ་ཡང་ཡོད། གཟུགས་ཀྱི་ཁམས་ཀྱི་འབྲས་བུའི་ལམ་ཡང་ཡོད། གཟུགས་ཀྱི་འདོད་ཆགས་ཀྱི་གཉེན་པོ་ཡང་ཡོད། གཟུགས་མེད་པའི་ཁམས་ཀྱི་འབྲས་བུའི་ལམ་ཡང་ཡོད། གཟུགས་མེད་པའི་འདོད་ཆགས་ཀྱི་གཉེན་པོ་ཡང་ཡོད། སྲིད་པའི་འབྲས་བུ་ཡང་ཡོད། འབྱུང་བའི་འབྲས་བུ་ཡང་ཡོད། ཉན་ཐོས་ཀྱི་འབྲས་བུར་འགྱུར་བ་ཡང་ཡོད། རང་བྱང་ཆུབ་ཀྱི་འབྲས་བུར་འགྱུར་བ་ཡང་ཡོད། སངས་རྒྱས་ཀྱི་འབྲས་བུར་འགྱུར་བ་ཡང་ཡོད། ངེས་པ་ཡང་ཡོད། མ་ངེས་པ་ཡང་ཡོད། ཉེས་པར་སྤྱོད་པའི་གཉེན་པོར་འགྱུར་བ་ཡང་ཡོད། ཀུན་ནས་ལྡང་བའི་གཉེན་པོར་གྱུར་པ་ཡང་ཡོད། བག་ལ་ཉལ་གྱི་གཉེན་པོར་གྱུར་པ་ཡང་ཡོད། འདོད་ཆགས་ཀྱི་གཉེན་པོར་གྱུར་པ་ཡང་ཡོད། ཞེ་སྡང་གི་གཉེན་པོར་གྱུར་པ་ཡང་ཡོད། གཏི་མུག་གི་གཉེན་པོར་གྱུར་པ་ཡང་ཡོད། ང་རྒྱལ་གྱི་གཉེན་པོར་གྱུར་པ་ཡང་ཡོད། ལྟ་བའི་གཉེན་པོར་གྱུར་པ་ཡང་ཡོད། ཞི་གནས་སྒྲུབ་པ་ཡང་ཡོད། ལྷག་མཐོང་སྒྲུབ་པ་ཡང་ཡོད། ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒྲུབ་པ་ཡང་ཡོད། བྱང་ཆུབ་ཀྱི་ཕྱོགས་བསྒོམ་པ་སྒྲུབ་པ་ཡང་ཡོད། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྒྲུབ་པ་ཡང་ཡོད། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྒྲུབ་པ་ཡང་ཡོད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་སྒྲུབ་པར་བྱེད་པ་ཡང་ཡོད། ས་ཡོངས་སུ་སྦྱོང་བ་སྒྲུབ་པ་ཡང་ཡོད། མངོན་པར་ཤེས་པ་སྒྲུབ་པ་ཡང་ཡོད། དབང་སྒྲུབ་པ་ཡང་ཡོད། བསོད་ནམས་ཀྱི་ཚོགས་ཡོངས་སུ་སྒྲུབ་པ་ཡང་ཡོད།
en: They know a path of suffering here that becomes happiness beyond; a path of happiness here that becomes suffering beyond; one where there is suffering in both, and one where there is happiness in both; a path that is of benefit to themselves but not of benefit to others, of benefit to others but not of benefit to themselves, of benefit to both, and that does not benefit either; and also a path that results in the desire realm, that counteracts attachment to the objects of the senses; a path that results in the form realm, that counteracts attachment to form; a path that results in the formless realm, that counteracts attachment to formlessness; one with suffering existence as a result, with escape as a result, with a śrāvaka as a result, with a pratyekabuddha’s awakening as a result, and with a buddha as a result; a path of those predestined, and one of those not predestined; one that counteracts attachment to wrongdoing, counteracts obsession, counteracts residual impressions, counteracts attachment, counteracts anger, counteracts confusion, counteracts pride, and counteracts views; and one that is a practice for accomplishing calm abiding, a practice for accomplishing special insight, a practice for accomplishing the perfections, a practice of cultivating the side of awakening, a practice that brings beings to maturity, a practice that brings the buddhadharmas to maturity, a practice for accomplishing the purification of a buddhafield, a practice that accomplishes the preparations for the levels, a practice for accomplishing clairvoyance, a practice for accomplishing the faculties, a practice for completely accomplishing the accumulation of merit, and a practice for accomplishing the accumulation of knowledge.

source: ཡེ་ཤེས་ཀྱི་ཚོགས་སྒྲུབ་པ་ཡང་ཡོད་པར་རབ་ཏུ་མཁྱེན་ཏེ། འདི་ནི་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་མཁྱེན་པའི་སྟོབས་སོ། །བསམ་གཏན་དང་།
en: This is the power of knowing “the path that goes everywhere.”

source: རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་ལྡན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བ་ནི་དེ་ལ་བསམ་གཏན་དང་པོ་ལ་སོགས་པ་བསམ་གཏན་བཞི་པོ་དག་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་པོ་དག་དང་། རྟོག་པ་དང་བཅས།
en: Seventh power “Accurately knowing the defilement and purification of all concentrations, deliverances, meditative stabilizations, and absorptions.”

source: དཔྱོད་པ་དང་བཅས་པ་ལ་སོགས་པའི་ཏིང་ངེ་འཛིན་གསུམ་པོ་དག་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་པོ་དག་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་པོ་དག་དང་། དེ་དག་གི་ཀུན་ནས་ཉོན་མོངས་པ་གང་ཡིན་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་རྒྱུ་གང་ཡིན་པ་དང་། རྣམ་པར་བྱང་བ་གང་ཡིན་པ་དང་། རྣམ་པར་བྱང་བའི་རྒྱུ་གང་ཡིན་པ་དང་། དེ་དག་ལས་ལྡང་བའི་རྒྱུ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ།
en: They know all the four concentrations—the first concentration and so on—the three meditative stabilizations that have applied thought and have sustained thought and so on, the four formless absorptions, and the nine serial absorptions, as well as their defilement and the cause of their defilement, their purification and the cause of their purification, and the causes of emergence from them.

source: །དེ་ལ་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་། སྲིད་པའི་དོན་དུ་ཡོངས་སུ་བསྔོ་བ་དང་། ལྟ་བ་སྣ་ཚོགས་དང་ལྡན་པ་དང་། རོ་མྱོང་བར་བྱེད་པ་དང་ལྡན་པ་དང་། དམིགས་པ་ཡིད་ལ་བྱེད་པའི་དབང་གིས་བསམ་གཏན་ལ་སོགས་པའི་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་རོ།
en: There, the concentrations and so on become defiled through the power of improper attention, dedication to suffering existence, having various views, having an experience of the taste, and paying attention to an objective support.

source: །བསམ་གཏན་གྱི་ཡན་ལག་ལ་སྙོམས་པར་ཞུགས་ནས་མཐོང་ངམ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕྱིར་རམ། མངོན་པར་ཤེས་པ་སྒྲུབ་པའམ། མི་དམིགས་པ་ཡིད་ལ་བྱེད་པ་བསམ་གཏན་ལ་སོགས་པ་རྣམ་པར་བྱང་བར་འགྱུར་རོ། །ལྡང་བ་ནི་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའམ།
en: The concentrations and so on that are absorbed in the branches of a concentration for special insight or for bringing beings to maturity, or that accomplish the clairvoyances or pay attention without an objective support and so on, become purified. “

source: ཐོད་རྒལ་དུ་སྙོམས་པར་འཇུག་པས་ལུགས་དང་མཐུན་པའམ།
en: The emergence” comes about through the power of absorption in the siṃha­vijṛmbhita and avaskandhaka meditative stabilizations in direct and reverse order.

source: ལུགས་ལས་བཟློག་པ་ལ་སོགས་པའི་དབང་གིས་འགྱུར་ཏེ། འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་ལ་ཡང་སྙོམས་པར་འཇུག་པ་ལ་རྟག་ཏུ་མཉམ་པར་གཞག་པ་ཡང་ཡིན་ནོ།
en: Here tathāgatas are always in meditative equipoise, absorbed in meditative stabilization.

source: །ཏིང་ངེ་འཛིན་གཅིག་ཏུ་ཡང་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྙོམས་པར་འཇུག་ཅིང་བཞེངས་སོ།
en: Even if the meditative stabilization is singular, they become absorbed in and emerge from all meditative stabilizations.

source: །ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ནང་དུ་ཏིང་ངེ་འཛིན་གཅིག་སྟོན་ཅིང་བཞེངས་ཏེ། མདོ་ལས་ཇི་སྐད་འབྱུང་བ་བཞིན་ནོ།
en: They demonstrate one meditative stabilization inside all the meditative stabilizations and emerge from it, just as it is found in the Sūtra.

source: །ཏིང་ངེ་འཛིན་གཅིག་གིས་ཀྱང་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་བྱ་བ་རྣམས་མཛད་དོ། །ཏིང་ངེ་འཛིན་མང་པོས་ཏིང་ངེ་འཛིན་གཅིག་གི་བྱ་བ་མཛད་དོ།
en: A single meditative stabilization, furthermore, does the work of all meditative stabilizations, and many meditative stabilizations do the work of a single meditative stabilization.

source: །ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་བཞེངས་པ་གཅིག་སྟོན་ཏོ། །ཏིང་ངེ་འཛིན་སྣ་ཚོགས་ལས་བཞེངས་པ་སྣ་ཚོགས་སྟོན་ཏོ།
en: They demonstrate a single emergence from all meditative stabilizations, demonstrate a variety of emergences from a variety of meditative stabilizations, and they demonstrate a single meditative stabilization from a variety of emergences.

source: །བཞེངས་པ་སྣ་ཚོགས་ལས་ཏིང་ངེ་འཛིན་གཅིག་སྟོན་ཏོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡང་མདོ་ལས་ཇི་སྐད་དུ་འབྱུང་བ་བཞིན་དུ་གཟུང་བར་བྱ་སྟེ།
en: You can grasp these and so on as they are found in the Sūtra.

source: འདི་ནི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་མཁྱེན་པའི་སྟོབས་སོ།
en: This is the power that “knows concentrations, deliverances, meditative stabilizations, and absorptions.”

source: །སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མཁྱེན་པའི་སྟོབས་དང་། ལྷའི་མིག་གིས་མངོན་པར་ཤེས་པ་མཁྱེན་པའི་སྟོབས་དང་། ཟག་པ་ཟད་པ་མཁྱེན་པའི་སྟོབས་ཀྱང་གཞུང་ཉིད་ལས་འབྱུང་བ་བཞིན་དུ་གཟུང་བར་བྱའོ།། །།
en: Eighth to tenth powers You should comprehend the power of “recollecting and knowing… previous lives”; the power that knows “the divine eye,” clairvoyance; and the power that knows “an end to outflows,” just as they are found in the scripture.

source: མི་འཇིགས་པ་བཞི་སྟེ་ཞེས་བྱ་བ་ལ། དང་པོ་དང་གཉིས་པ་ནི་རང་གི་དོན་ལས་བརྩམས་པའོ། །གསུམ་པ་དང་བཞི་པ་ནི་གཞན་གྱི་དོན་ལས་བརྩམས་པའོ།
en: Great Vehicle of the four fearlessnesses “The four fearlessnesses”— the first and second take their own welfare as their point of departure; the third and fourth take the welfare of others as their point of departure. “

source: །དགེ་སྦྱོང་དང་བྲམ་ཟེ་ཞེས་བྱ་བ་ལ་སོགས་པ་ལ། ཤེས་རབ་ཀྱིས་མངོན་པའི་ང་རྒྱལ་བྱེད་པའི་ཕྱིར། དགེ་སྦྱོང་དང་བྲམ་ཟེ་སྨོས་སོ།
en: Those leading a secluded religious life, and brahmins,” and so on—they are called “those leading a secluded religious life, and brahmins” because their wisdom makes them conceited.

source: །ལྷའི་མིག་དང་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་ལ་སོགས་པ་ཕུན་སུམ་ཚོགས་པའི་ཕྱིར་ལྷ་དང་། བདུད་སྨོས་སོ།
en: Others are called “the gods, [and] Māra” because they have the perfect divine eye and know what others are thinking and so on.

source: །རྫུ་འཕྲུལ་དང་མཐུ་ཆེ་བའི་ཕྱིར་ཚངས་པ་རྣམས་སྨོས་སོ།
en: Others are called “Brahmā” because of their miraculous powers and because they are incredibly powerful. “

source: །རྒྱུ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ་ཞེས་བྱ་བ་ནི་དེ་དག་གིས་བརྒལ་བའི་རྒྱུར་འགྱུར་བ་འགལ་བ་དེ་ཅུང་ཟད་ཀྱང་མི་མཐོང་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: I see no cause”— in the sense that they do not see any contradiction at all that would turn into a reason to “argue” with them. “

source: །བདེ་བ་ཐོབ་ཅེས་བྱ་བ་ནི་ལུས་ཀྱི་སྤུ་ཟིང་ཞེས་བྱེད་པ་དང་། བག་འཁུམས་པ་ལ་སོགས་པ་མེད་པར་བསྟན་ཏོ།
en: I, who have found happiness” teaches their body hair bristles—that they are not nervous and so on.

source: །དེའི་དབང་གིས་ཅང་ཤེས་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེས་ཏེ། སྐུའི་ཕྲིན་ལས་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: On account of that, they announce that theirs is “the status of the dominant bull,” a thoroughbred, because their physical actions are completely purified. “

source: །བག་ཚ་བ་མེད་པར་ཐོབ་ཅེས་བྱ་བ་ནི་གསུང་ལ་ཞུམ་པ་དང་། དམན་པར་གྱུར་པ་ལ་སོགས་པ་མེད་པར་བསྟན་ཏོ།
en: Found fearlessness” teaches they are not cowed and do not feel trepidation and so on when it comes to speaking.

source: །དེའི་དབང་གིས་སེང་གེ་བཞིན་དུ་སྒྲོག་སྟེ། གསུང་གི་ཕྲིན་ལས་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: On account of that they “roar” like “the lion,” because their verbal action is completely purified. “

source: །མི་འཇིགས་པ་ཐོབ་ཅེས་བྱ་བ་ནི་ཐུགས་ལ་དོགས་པ་དང་། ཞུམ་པ་ལ་སོགས་པ་མེད་པར་བསྟན་ཏོ།
en: Found a ground for self-confidence” teaches they have no doubt or feeling of being cowed in their minds.

source: །དེའི་དབང་གིས་ཚངས་པ་བཞིན་དུ་འཁོར་ལོ་བསྐོར་ཏེ། ཐུགས་ཀྱི་ཕྲིན་ལས་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: On account of that they, “Brahmā-like, turn the wheel” because their mental actions are completely purified.

source: །ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པའི་གསུང་རབ་ཏུ་རྟོགས་པ་ཚིག་གི་ཚོགས་དང་། མིང་གི་ཚོགས་དང་། ཡི་གེའི་ཚོགས་ཀྱི་བདག་ཉིད་ཀྱི་གཞུང་མང་པོ་སྟེ།
en: Great Vehicle of the four detailed and thorough knowledges “The detailed and thorough knowledge of dharmas, detailed and thorough knowledge of meanings”— realization as the speech of a tathāgata is the many scriptures in the form of the collections of statements, collections of names, and collections of syllables.

source: འདིས་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པར་འགྱུར་བའམ། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཕྱིར་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: It is detailed and thorough knowledge of dharmas because on account of it detailed and thorough knowledge of dharmas comes about, or because it is detailed and thorough knowledge of dharmas.

source: །དོན་ཅེས་བྱ་བ་ནི་བརྗོད་པར་བྱ་བའི་ཚོགས་ཏེ།
en: The “meanings” are the collections of subject matter.

source: དེ་ཤེས་པ་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: The knowledge of those is “the detailed and thorough knowledge of meanings.”

source: །ཡང་ན་རྒྱུ་དང་རྐྱེན་གྱི་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཏེ།
en: Alternatively, “dharmas” are all cause and condition dharmas.

source: དེ་དག་ཤེས་པ་ནི་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: The knowledge of them is “detailed and thorough knowledge of dharmas.”

source: །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འབྲས་བུའི་ཆོས་རྣམས་ཤེས་པ་ནི། དོན་སོ་སོ་ཡང་དག་པར་རིག་པའོ། །ཡང་ན་རྣམ་པར་སྨིན་པ་དང་བཅས་པའི་ཆོས་དགེ་བ་དང་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཏེ།
en: The knowledge of all the dharmas that are dependently originated results is “detailed and thorough knowledge of meanings.” Alternatively, “dharmas” are wholesome and unwholesome dharmas that have maturations.

source: །སྒྲིབ་པ་དང་མི་སྒྲིབ་པ་དང་། ལུང་དུ་མ་བསྟན་པའི་ཆོས་རྣམས་ནི་དོན་ཏེ།
en: The “meanings” are obscured, unobscured, and neutral dharmas.

source: དོན་དེ་དག་ཤེས་པ་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: The knowledge of those is “detailed and thorough knowledge of meanings.”

source: །ཡང་ན་ཀུན་འབྱུང་བ་དང་། ལམ་གྱི་བདེན་པར་རྟོགས་པ་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་ཆོས་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཏེ།
en: Alternatively, “dharmas” are all the dharmas that are defilement and purification side dharmas when the truths of origination and the path are realized.

source: །སྡུག་བསྔལ་གྱི་བདེན་པ་དང་། འགོག་པའི་བདེན་པར་གཏོགས་པའི་ཆོས་ཐམས་ཅད་ནི་དོན་ཏེ།
en: The “meanings” are all the dharmas included in the truth of suffering and the truth of cessation.

source: དེ་དག་ཤེས་པ་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: The knowledge of those is “detailed and thorough knowledge of meanings.”

source: །ཡང་ན་གདུལ་བ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། སྤྱོད་པ་དང་། མོས་པ་དང་། དབང་པོ་ལ་སོགས་པ་ཐམས་ཅད་ནི་ཆོས་ཏེ།
en: Alternatively, “dharmas” are all the intentions, tendencies, behaviors, beliefs, faculties, and so on of trainees.

source: དེ་དག་ཤེས་པ་ནི་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པའོ། །མགོ་སྨོས་པ་དང་། རྣམ་པར་སྤྲོས་པ་གོ་བ་དང་། དྲང་དགོས་པ་དང་། ཚིག་ལྷུར་ལེན་པ་དང་། ཉོན་མོངས་པ་ཆེ་བ་དང་།
en: The knowledge of them is “detailed and thorough knowledge of dharmas.”

source: ཆུང་བ་དང་། དབང་པོ་རྣོ་བ་དང་། རྟུལ་བ་དང་། སྐལ་བ་ཡོད་པ་དང་། སྐལ་བ་མེད་པ་ལ་སོགས་པའི་གདུལ་བ་རྣམས་ནི་དོན་ཏེ།
en: The “meanings” are trainees who understand by way of a brief indication and by detailed explanation, those who need to be led and who are literalists, those who have big and little afflictions, those who have sharp and dull faculties, and those who have good fortune and have no good fortune, and so on.

source: །དེ་དག་ཤེས་པ་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: The knowledge of those is “detailed and thorough knowledge of meanings.” “

source: །ངེས་པའི་ཚིག་ཅེས་བྱ་བ་ནི་འཇིག་རྟེན་ན་གྲགས་པ་མིང་གི་ཚོགས་ལ་སོགས་པ་རྣམ་པ་མང་པོ་དེ་དག་ཉིད་ཀྱི་ཚིག་ངེས་པ་ལ་ངེས་པའི་ཚིག་ཅེས་བྱའོ། །ཡང་ན་གླིང་ཆེན་པོ་{བཅྭ་,བཅོ་}བརྒྱད་ན་གནས་པ་དང་། ཡུལ་ཆེན་པོ་བཅུ་དྲུག་དག་ན་གནས་པ་དང་།
en: Creative explanations”— “creative explanation” is the ascertainment of statements through just those many sorts of collections of names, and so on, well known in the world.

source: མཐའ་འཁོབ་དགུ་བཅུ་རྩ་བརྒྱད་ན་གནས་པ་དང་། ཡུལ་གྱི་དབུས་སུ་གཏོགས་པའི་མི་ཐམས་ཅད་དང་། དུད་འགྲོའི་སྐྱེ་གནས་སུ་གཏོགས་པ་དང་། {ཡི་དགས་,ཡི་དྭགས་}དང་། སེམས་ཅན་དམྱལ་བ་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་དང་། ཀླུ་དང་། དྲི་ཟ་དང་། མི་འམ་ཅི་ཐམས་ཅད་དང་། གྲུབ་པ་དང་།
en: Alternatively, “creative explanation” dharmas are all the sounds and expressions of humans living on the eighteen big continents, living in the sixteen major countries, living in the ninety-eight outer surrounding territories, and in the central country; of all animals in their birthplaces, of ghosts, and beings in the hells; of all asuras, nāgas, gandharvas, and kiṃnaras; of siddhas and mantradhāras; of musicians and actors and so on; of the desire realm gods of the Cāturmahā­rājika, Trāyastriṃśa and so on; of all the classes of Māras; and of all the classes of Brahmā and Śuddhāvāsa gods.

source: རིག་སྔགས་འཆང་དང་། རོལ་མོ་བྱེད་ཅིང་རྒྱུ་བ་ལ་སོགས་པ་དང་རྒྱལ་ཆེན་བཞིའི་རིས་དང་། སུམ་ཅུ་རྩ་གསུམ་ལ་སོགས་པ་འདོད་པའི་ཁམས་ཀྱི་ལྷ་རྣམས་དང་། བདུད་ཀྱི་རིས་ཐམས་ཅད་དང་། ཚངས་པ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་ཐམས་ཅད་ཀྱི་སྔགས་འཆང་དང་།
en: The knowledge of those is “detailed and thorough knowledge of creative explanations.”

source: བརྗོད་པ་གང་ཡིན་པ་ཐམས་ཅད་ནི་ངེས་པའི་ཚིག་གི་ཆོས་ཏེ། དེ་དག་ཤེས་པ་ནི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །ཤེས་པ་རྣམ་པ་གསུམ་པོ་དེ་དག་ཉིད་ཤེས་པ་གང་ཡིན་པ་དེ་ནི། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: The knowledge of just those three sorts of knowledge is “detailed and thorough knowledge of confidence giving readiness to speak.”

source: །གདུལ་བ་དེ་དག་ཉིད་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་མཐུན་པར་ཆོས་རྣམས་ཡང་དག་པར་སྟོན་པ་དང་། ཤེས་པར་བྱེད་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱེད་པ་ནི་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པའོ།
en: The perfect demonstration, knowledge, and mastery of doctrine in harmony with the intentions and tendencies of those same beings is “detailed and thorough knowledge of confidence giving readiness to speak.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་རྒྱུན་མ་ཆད་པར་འབྱུང་བ་དག་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པས་སྐད་ཅིག་གཅིག་ཁོ་ན་ལས་ཡང་དག་པར་འཛིན་ཏོ། །དོན་སོ་སོ་ཡང་དག་པར་རིག་པས་ནི་སྐད་ཅིག་དེ་ཉིད་ལ་ཆོས་དེ་དག་གི་དོན་ཀྱང་འཛིན་ཏོ། །སྐད་ཅིག་དེ་ཉིད་ལ། འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་ན། གདུལ་བ་སྣ་ཚོགས་ཀྱི་ངེས་པའི་ཚིག་རྣམས་སྣ་ཚོགས་ཀྱིས་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པས་ཆོས་སྟོན་ཏོ།
en: In just a single instant, with the detailed and thorough knowledge of dharmas bodhisattvas take up perfectly the unbroken flows of the streams of doctrine of all buddhas that emerge in all regions of the world; in that very same instant, with the detailed and thorough knowledge of meanings they also take up the meanings of those doctrines; in that very same instant, with the detailed and thorough knowledge of creative explanations they demonstrate the doctrine with various creative explanations for various trainees in various regions of world; and with the detailed and thorough knowledge of confidence giving readiness to speak they cause those trainees to take up the true nature of dharmas directly.

source: ཆོས་ཉིད་མངོན་སུམ་དུ་འཛིན་དུ་འཛུད་དོ།།སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་ཅེས་བྱ་བ་ལ།
en: Great Vehicle of the eighteen distinct attributes of a buddha As for the eighteen distinct attributes of a buddha, tathāgatas “do not go wrong.”
